Revit 2027 API
ViewPosition.GetPlacedViewportIdsForViewPosition Method
 Gets the placed viewport ids for the view position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ElementId> GetPlacedViewportIdsForViewPosition()
Public Function GetPlacedViewportIdsForViewPosition As IList(Of ElementId)
public:
IList<ElementId^>^ GetPlacedViewportIdsForViewPosition()
member GetPlacedViewportIdsForViewPosition : unit -> IList<ElementId>
Return Value
IList<ElementId>
 The placed viewport ids for the view position.
See Also
Reference
ViewPosition Class
Autodesk.Revit.DB Namespace